TOKEN = '1373424406:AAHDB0B5O3GlcyCdUaRv4W-ihgMy5wRpm7I' #anasteyshen_zbot
anasteyshen_zbot = f'https://api.telegram.org/bot{TOKEN}/'
download_file = f'https://api.telegram.org/file/bot{TOKEN}/'







#Text responses
answers = {
	'kira'		: "Я никогда эту шмару не прощу! 😭😠",
	'кира'		: "Я никогда эту шмару не прощу! 😭😠",
	'шмара'		: "Я никогда эту шмару не прощу! 😭😠"
}



bug = "ERROR: get_updates_json ('Connection aborted.', ConnectionResetError(10054, 'Удаленный хост принудительно разорвал существующее подключение', None, 10054, None))"

greeting = 'Ну що, привіт, новий друже! 🤪'
dosomething_ans = 'Ты уже как Федоровский 🙃'
url_ans = 'Ты хочешь поговорить об этом?'
text_link_ans = ', что это такое?'

'''

	"SergeiSergei": 440698810,

	
	"Gohnny": 506531795,
	"Karl0Marks": 398950029,
	"farcrak": 350704511,
	"ilya_shn": 569931327,
	"kitty_form": 769290282

	'''


#Dreams 
dreams = (
	['Я вспомнила свой сон', 
	'Максимально короткий и странный', 
	'Типа сидим за одним столом\nЯ,Илья,Женя,Петренко и Таровик\nИлья курит,а все остальные играют в карты', 	
	'Всё'],

	['Кстати', 
	'В общем мне приснился сон,который напомнил мне,что мой дядя тоже играет на гитаре как и Федоровский и вот вопрос.Это у программистов особый ритуал такой?'],

	['Снится,что мы с мамой зачем то приехали в психбольницу \n Зашли внутрь,она дала мне какой-то мячик и сказала его выкинуть\n Я зашла в одну из палат и меня в ней закрыли. Я сначала кричала, но потом подошла и тупо выбила рукой окно. Вылезла, швырнула этот мячик как можно дальше и села на лавочку.  \nТут ко мне прибегает мальчик и отдаёт мой мячик с фразой \n-о,ты новенькая?)))\nЯ понимаю,что он здесь пациент. После этого он зовёт остальных ребят и все начинают меня смотреть,щупать,что-то спрашивать \nЯ говорю в один момент \n-нет,я не болею \nОдин из них смотрит мне в глаза и говорит \n- Ну так до этого недолго осталось))\nВсе начинают смеяться,я резко просыпаюсь с пиздец каким чувством тревоги'],
	
	['Слушай ты блять не поверишь что мне приснилось)))))',
	'Снится,что у нас с какой-то девочкой общий магазинчик на двоих с всякими безделушками. Я захожу и виду,что касса взломана,вещи разбросаны,а из кладовки слышу какой-то шум. Хватаю сначала большой нож,потом кладу его,хватаю нож-бабочку,прячу в карман джинсовки и иду',
	'А там в общем какой-то мужик в балаклаве насилует эту девочку. В общем, упуская подробности, я воткнула ему нож в глаз😏 '],

	['На меня что-то навеяло, решила покурить на балконе',
	'Курю себе под "That\'s life",думаю о вечном\nВ доме напротив на балкон выходит какой-то чувак и тоже начинает курить,окей\nИ тут он начинает смотреть на меня (сначала я подумала,что меня глючит, я же слепая,НО НЕТ)\nИ тут он делает такой жест типа как чокнулся сигой. Я думаю ну ладно,сделала также \nОн докуривает,выбрасывает бычок,заходит в комнату,тушит свет \nЯ в замешательстве и раздумиях,показалось мне или нет докуриваю\nПесня заканчивается и я захожу\n'],

	['Мне снились "кошмары"', 
	'Что Женя сойтись хочет',
	'А мне пришлось врать,что я с Федоровским',
	'И он меня ударил',
	'))0'],

	['Мне приснился мой день рождения',
	'Да настолько идеальный,что я проснулась и заплакала',
	'Потому что понимаю,что у меня такого не будет',
	'С ДОБРЫМ УТРОМ',
	'И ещё мне снилось,что я,ты и Петренко стоим ночью под Макдональдсом на вокзале и курим',
	'🤪🤪🤪🤙🤙🤙'], 
	
	['Приснилось, что мы гуляли с Федоровским, зашли в магазин, спиздили стол, пришли домой, а по потолку ползёт черепаха', 
	'Доброе утро, блять']


)

